---
kind: other
id: Methods.T:Autodesk.Revit.DB.LinkOperations
source: html/26eeb7d1-73f1-2c84-3494-15d7d5e860f0.htm
---
# LinkOperations Methods

Sets the callback that will be called when the Revit user saves new shared coordinate
 settings to a linked document obtained from an IExternalResourceServer.